# 5. Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
# -  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї),
# пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" і при
# нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
# -  Повиннi опрацювати такi умови:
# -  x > y;       вiдповiдь - х бiльше нiж у на z
# -  x < y;       вiдповiдь - у бiльше нiж х на z
# -  x == y.      вiдповiдь - х дорiвнює z
def difference(x, y):
    x = int(x)
    y = int(y)
    if x > y:
        print (x, 'більше ніж ', y, 'на', x-y)
    if x < y:
        print (y, ',більше ніж', x, 'на', y-x)
    if x == y:
        print (x, 'дорівнює', x)
