# 4. Створiть 3 рiзних функцiї (на ваш вибiр). Кожна з цих функцiй повинна повертати якийсь результат.
# Також створiть четверу ф-цiю, яка в тiлi викликає 3 попереднi, обробляє повернутий ними результат та
# також повертає результат. Таким чином ми будемо викликати 1 функцiю, а вона в своєму тiлi ще 3
def processing_numbers(x, y):
    x = int(x)
    y = int(y)
    def summa():
        return x + y
    def diff():
        return x - y
    def prod():
        return x * y
    return print(summa(), diff(), prod())
